Podkova/src/DataProcessors/ПанельАдминистрированияЭДО/ПанельАдминистрированияЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПанельАдминистрированияЭДО</name>
</mdclass:DataProcessor>

Podkova/src/InformationRegisters/УчетныеЗаписиЭДО/УчетныеЗаписиЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетныеЗаписиЭДО</name>
  <resources>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </resources>
  <resources>
    <name>НаименованиеУчетнойЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОператорЭДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОбменаЭД</name>
    <type>
      <types>EnumRef.СпособыОбменаЭД</types>
    </type>
  </resources>
  <resources>
    <name>ЭлектроннаяПочтаДляУведомлений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОжидатьИзвещениеОПолучении</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УведомлятьОНовыхПриглашениях</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УведомлятьОбОтветахНаПриглашения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УведомлятьОНовыхДокументах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УведомлятьОНеОбработанныхДокументах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УведомлятьОбОкончанииСрокаДействияСертификата</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КодНалоговогоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресОрганизации</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИмяФайлаСоглашенияНаРоуминг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДанныеСоглашенияНаРоуминг</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСоглашенияНаРоуминг</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПассивноеСоединениеFTP</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПортFTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПутьFTP</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>УчетнаяЗаписьЭлектроннойПочты</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </resources>
  <resources>
    <name>EmailОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НазначениеУчетнойЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеУчетнойЗаписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновитьНастройкиУведомлений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятыУсловияИспользования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторЭДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/InformationRegisters/СертификатыУчетныхЗаписейЭДО/СертификатыУчетныхЗаписейЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СертификатыУчетныхЗаписейЭДО</name>
  <resources>
    <name>ДействителенДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторЭДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/DataProcessors/ПанельАдминистрированияЭДО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ПроверкаНастроекРегламентныхЗаданий

// Запускает проверку настроек в фоне
//
Функция НачатьПроверкуНастроекРегламентныхЗаданий(ИдентификаторФормы, ИнициировалПользователь = Ложь, Операция = "ПоУмолчанию") Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ИнициировалПользователь", ИнициировалПользователь);
	ПараметрыПроцедуры.Вставить("Операция",                Операция);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.ПанельАдминистрированияЭДО.ПроверитьНастройкиРегламентныхЗаданийЭДО", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

Функция РезультатЗапросаСертификатов(ИдентификаторЭДО = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетныеЗаписи.ИдентификаторЭДО КАК ИдентификаторЭДО,
	|	УчетныеЗаписи.НаименованиеУчетнойЗаписи КАК НаименованиеУчетнойЗаписи,
	|	ЕСТЬNULL(Сертификаты.Сертификат, НЕОПРЕДЕЛЕНО) КАК Сертификат
	|ИЗ
	|	РегистрСведений.УчетныеЗаписиЭДО КАК УчетныеЗаписи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СертификатыУчетныхЗаписейЭДО КАК Сертификаты
	|		ПО УчетныеЗаписи.ИдентификаторЭДО = Сертификаты.ИдентификаторЭДО
	|			И (НЕ Сертификаты.Сертификат.Отозван)
	|			И (Сертификаты.Сертификат.ДействителенДо > &ТекущаяДата)
	|			И (Сертификаты.Сертификат.Отпечаток В (&ОтпечаткиСервера))
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ИдентификаторЭДО = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ УчетныеЗаписи.ИдентификаторЭДО = &ИдентификаторЭДО
	|		КОНЕЦ
	|	И Сертификаты.Сертификат.Пользователь В (&Пользователи)
	|ИТОГИ ПО
	|	ИдентификаторЭДО";
	
	ОтпечаткиСертификатовСервера = ЭлектронноеВзаимодействиеСлужебныйВызовСервера.МассивОтпечатковСертификатов(Ложь);
	
	Запрос.УстановитьПараметр("ИдентификаторЭДО", ИдентификаторЭДО);
	Запрос.УстановитьПараметр("ТекущаяДата",      ТекущаяУниверсальнаяДата());
	Запрос.УстановитьПараметр("ОтпечаткиСервера", ОтпечаткиСертификатовСервера);
	
	ПользователиСертификата = Новый Массив;
	ПользователиСертификата.Добавить(Справочники.Пользователи.ПустаяСсылка());
	ПользователиСертификата.Добавить(Пользователи.СсылкаНеуказанногоПользователя());
	
	Запрос.УстановитьПараметр("Пользователи", ПользователиСертификата);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ПарольСертификатаСохраненДляВсех(Сертификат) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Данные = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Сертификат, "ПаролиСертификатов");
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Данные <> Неопределено
		И ЗначениеЗаполнено(Данные[Справочники.Пользователи.ПустаяСсылка()]);
	
КонецФункции

// Проверяет выполнение необходимых условий для работы регламентных заданий
// по отправке и получению электронных документов.
Процедура ПроверитьНастройкиРегламентныхЗаданийЭДО(Параметры, АдресРезультата) Экспорт
	
	// Коды состояний.
	// 0 - Блокирующая ошибка.
	// 1 - Неблокирующая ошибка.
	// 2 - Ошибок нет.
	
	РежимРаботы         = 0; // режим работы только "клиент - сервер"
	ЕстьКриптоПровайдер = 0; // криптопровайдер установлен на сервере
	ЕстьСертификаты     = 0; // есть сертификаты на сервере и они подвязаны к профилям
	ПаролиСохранены     = 0; // по каждому профилю есть хотя бы один сертификат с сохраненным для всех паролем
	ПроверкаПодписи     = 0; // подписи проверяются на сервере
	СозданиеПодписи     = 0; // подписи создаются на сервере
	
	// 1) Режим работы только клиент-сервер
	Если Не ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		РежимРаботы = 2;
	КонецЕсли;
	
	Если РежимРаботы Тогда // остальные проверки актуальны только для клиент-серверной базы
		
		// 2) Криптопровайдер установлен на сервере.
		Отказ = Ложь;
		МенеджерКриптографии = ЭлектронноеВзаимодействиеСлужебный.МенеджерКриптографии(Отказ, Ложь);
		
		Если Не Отказ Тогда
			ЕстьКриптоПровайдер = 2;
		КонецЕсли;
		
		// Совмещаем проверки.
		// 3) Есть сертификаты на сервере для всех профилей.
		// 4) Пароли сертификатов сохранены.
		
		ВсеСертификатыНаСервере = Истина;
		ВсеПаролиСохранены      = Истина;
		
		ХотяБыОдинСертификатНаСервере = Ложь;
		ХотяБыОдинПарольСохранен      = Ложь;
		
		РезультатЗапроса = РезультатЗапросаСертификатов();
		
		Если РезультатЗапроса.Пустой() Тогда
			
			ВсеСертификатыНаСервере = Ложь;
			ВсеПаролиСохранены      = Ложь;
			
		Иначе
			
			ВыборкаУчетныхЗаписей = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаУчетныхЗаписей.Следующий() Цикл
				
				// Определяем в разрезе профиля.
				ЕстьСертификатНаСервере = Ложь;
				ЕстьСохраненныйПароль   = Ложь;
				
				ВыборкаСертификат = ВыборкаУчетныхЗаписей.Выбрать();
				Пока ВыборкаСертификат.Следующий() Цикл
					
					Если ЗначениеЗаполнено(ВыборкаСертификат.Сертификат) Тогда
						ЕстьСертификатНаСервере = Истина;
						Если ПарольСертификатаСохраненДляВсех(ВыборкаСертификат.Сертификат) Тогда
							ЕстьСохраненныйПароль = Истина;
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
				
				Если ЕстьСертификатНаСервере Тогда
					
					ХотяБыОдинСертификатНаСервере = Истина;
					
					Если ЕстьСохраненныйПароль Тогда
						ХотяБыОдинПарольСохранен = Истина;
					Иначе
						ВсеПаролиСохранены = Ложь;
					КонецЕсли;
					
				Иначе
					ВсеСертификатыНаСервере = Ложь;
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не ХотяБыОдинПарольСохранен Тогда
				ВсеПаролиСохранены = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		// Есть сертификаты на сервере для всех профилей.
		Если ВсеСертификатыНаСервере Тогда
			ЕстьСертификаты = 2;
		ИначеЕсли ХотяБыОдинСертификатНаСервере Тогда
			ЕстьСертификаты = 1;
		КонецЕсли;
		
		// Пароли сертификатов сохранены.
		Если ВсеПаролиСохранены Тогда
			ПаролиСохранены = 2;
		ИначеЕсли ХотяБыОдинПарольСохранен Тогда
			ПаролиСохранены = 1;
		КонецЕсли;
		
		// 5) Проверка подписей и сертификатов происходит на сервере.
		Если ЭлектроннаяПодпись.ПроверятьЭлектронныеПодписиНаСервере() Тогда
			ПроверкаПодписи = 2;
		КонецЕсли;
		
		// 6) Подпись и шифрование происходит на сервере.
		Если ЭлектроннаяПодпись.СоздаватьЭлектронныеПодписиНаСервере() Тогда
			СозданиеПодписи = 2;
		КонецЕсли;
		
	КонецЕсли;
	
	// Итог проверки.
	Успех = РежимРаботы
		И ЕстьКриптоПровайдер
		И ЕстьСертификаты
		И ПаролиСохранены
		И ПроверкаПодписи
		И СозданиеПодписи;
	
	Результат = Новый Структура;
	Результат.Вставить("ИнициировалПользователь", Параметры.ИнициировалПользователь);
	Результат.Вставить("Операция",                Параметры.Операция);
	Результат.Вставить("РежимРаботы",             РежимРаботы);
	Результат.Вставить("ЕстьКриптоПровайдер",     ЕстьКриптоПровайдер);
	Результат.Вставить("ЕстьСертификаты",         ЕстьСертификаты);
	Результат.Вставить("ПаролиСохранены",         ПаролиСохранены);
	Результат.Вставить("ПроверкаПодписи",         ПроверкаПодписи);
	Результат.Вставить("СозданиеПодписи",         СозданиеПодписи);
	Результат.Вставить("Успех",                   Успех);
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
